/* Automatic Update Alert Description (Critical Update) */
"%1$@ %2$@ has been downloaded and is ready to use! This is an important update; would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ on ladattu ja valmis käytettäväksi! Tämä on tärkeä päivitys; haluatko asentaa sen ja käynnistää %1$@ -sovelluksen uudelleen heti?";

/* Automatic Update Alert Description (Normal Update) */
"%1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ on ladattu ja valmis käytettäväksi! Haluatko asentaa sen ja käynnistää %1$@ -sovelluksen uudelleen heti?";

/* No comment provided by engineer. */
"%1$@ can't be updated when it's running from a read-only volume like a disk image or an optical drive. Move %1$@ to your Applications folder, relaunch it from there, and try again." = "%1$@ -sovellusta ei voi päivittää, kun sitä suoritetaan kirjoitussuojatulta asemalta, kuten levykuvalta tai optiselta asemalta. Siirrä %1$@ Applications-kansioon, käynnistä se uudelleen sieltä ja yritä uudelleen.";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ on tällä hetkellä uusin saatavilla oleva versio.";

/* No comment provided by engineer. */
"%@ downloaded" = "%@ ladattu";

/* No comment provided by engineer. */
"%@ of %@" = "%1$@ / %2$@";

/* Description text for SUUpdateAlert when the update is downloadable. */
"A new version of %@ is available. Update to %@ to experience the latest improvements." = "Uusi %1$@-versio on saatavilla. Päivitä versioon %2$@ kokeaksesi uusimmat parannukset.";

/* Description text for SUUpdateAlert when the update informational with no download. */
"A new version of %@ is available. Update to %@ to experience the latest improvements. Would you like to learn more about this update on the web?" = "Uusi %1$@-versio on saatavilla. Päivitä versioon %2$@ kokeaksesi uusimmat parannukset. Haluatko lukea verkosta lisätietoja tästä päivityksestä?";

/* Automatic Update Alert Title (Normal Update) */
"A new version of %@ is ready to install!" = "%@ -sovelluksen uusi versio on valmis asennettavaksi!";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "Virhe päivitystietoja haettaessa. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while downloading the update. Please try again later." = "Päivitystä ladattaessa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "Arkistoa purettaessa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while installing the update. Please try again later." = "Päivitystä asennettaessa tapahtui virhe. Yritä myöhemmin uudelleen.";

/* No comment provided by engineer. */
"An error occurred while parsing the update feed." = "Päivityssyötettä jäsennettäessä tapahtui virhe.";

/* No comment provided by engineer. */
"An error occurred while relaunching %1$@, but the new version will be available next time you run %1$@." = "Sovellusta %1$@ uudelleenkäynnistettäessä tapahtui virhe, mutta uusi versio on käytettävissä, kun käynnistät %1$@ -sovelluksen seuraavan kerran.";

/* Automatic Update Alert Title (Critical Update) */
"An important update to %@ is ready to install" = "%@ -sovelluksen tärkeä päivitys on valmis asennettavaksi";

/* the unit for bytes */
"B" = "t";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cancel Update" = "Peruuta päivitys";

/* No comment provided by engineer. */
"Checking for updates..." = "Tarkistetaan päivityksiä...";

/* Take care not to overflow the status window. */
"Downloading update..." = "Ladataan päivitystä...";

/* Take care not to overflow the status window. */
"Extracting update..." = "Puretaan päivitystä...";

/* the unit for gigabytes */
"GB" = "Gt";

/* No comment provided by engineer. */
"Install and Relaunch" = "Asenna ja käynnistä uudelleen";

/* Take care not to overflow the status window. */
"Installing update..." = "Asennetaan päivitystä...";

/* the unit for kilobytes */
"KB" = "Kt";

/* Alternate title for 'Install Update' button when there's no download in RSS feed. */
"Learn More..." = "Lisätietoja...";

/* No comment provided by engineer. */
"Let's update your app" = "Päivitetäänpä sovelluksesi";

/* the unit for megabytes */
"MB" = "Mt";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Ready to Install" = "Valmis asennettavaksi";

/* No comment provided by engineer. */
"Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu." = "Haluatko, että %1$@ tarkistaa päivitysten saatavuuden automaattisesti? Voit aina tarkistaa päivitysten saatavuuden manuaalisesti %1$@ -valikosta.";

/* No comment provided by engineer. */
"The update is improperly signed." = "Päivitys on allekirjoitettu virheellisesti.";

/* No comment provided by engineer. */
"The update will not be installed because the user requested for the system to power off" = "Päivitystä ei asenneta, koska käyttäjä pyysi sammuttamaan järjestelmän";

/* Automatic Update Alert Title (Forced Update) */
"Uh oh. Your version of %@ is out of date." = "Voi ei. %@-versiosi on vanhentunut.";

/* No comment provided by engineer. */
"Update Error!" = "Päivitysvirhe!";

/* No comment provided by engineer. */
"Updating %@" = "Päivitetään %@ -sovellusta";

/* 'Error' message when the user checks for updates but is already current or the feed doesn't contain any updates. (not necessarily shown in UI) */
"You already have the newest version of %@." = "Sinulla on jo uusin versio %@ -sovelluksesta.";

/* Status message shown when the user checks for updates but is already current or the feed doesn't contain any updates. */
"You're up-to-date!" = "Olet ajan tasalla!";

/* Automatic Update Alert Description (Forced Update) */
"You’re currently on version %@ which is no longer supported. We’ve made a lot of improvements since then so please download the latest version to continue." = "Sinulla on tällä hetkellä versio %@, jota ei enää tueta. Olemme tehneet paljon parannuksia sen jälkeen, joten lataa uusin versio jatkaaksesi.";
